starter_multiphase/base_case/0/p
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  10
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;
boundaryField
{
    inlet   { type fixedFluxPressure; value uniform 1e5; }
    outlet  { type totalPressure; p0 uniform 1e5; U U; phi phi; rho rho; psi none; gamma 1; value uniform 1e5; }
    walls   { type fixedFluxPressure; value uniform 1e5; }
}
