starter_multiphase/base_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       5500;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       5600;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       5700;
    }
)

// ************************************************************************* //
