starter_multiphase/base_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v10                                    |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Domain: 0.1 x 0.05 x 0.05 m, droplet injected near center
convertToMeters 1;

vertices
(
    (0     0     0)
    (0.1   0     0)
    (0.1   0.05  0)
    (0     0.05  0)
    (0     0     0.05)
    (0.1   0     0.05)
    (0.1   0.05  0.05)
    (0     0.05  0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 10) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
