starter_multiphase/base_case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default                         none;
    div(phi,U)                      Gauss limitedLinearV 1;
    div(phi,K)                      Gauss limitedLinear 1;
    div(phi,h)                      Gauss limitedLinear 1;
    div(phi,Yi_h)                   Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear uncorrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default uncorrected; }

// ************************************************************************* //
